/*
 *  클래스 :
 *    용도 1. 사용자 정의 데이터형 => 데이터형 클래스
 *          => 메모리 저장 / 메모리 읽기
 *          => 실무 / 프로젝트 => ~VO , ~DTO
 *                           ----------- 캡슐화 (데이터 보호목적)
 *          => 관련된 데이터를 묶어서 사용 => 관리가 용이 , 추가 쉽게
 *       	=> 초기화
 *              |
 *             초기화 블록
 *             -------
 *             생성자
 *             -------
 *             
 *        2. 액션 클래스 => 메소드의 묶음
 *          => 게시판 (목록 출력,수정,상세보기,삭제,추가,검색)
 *        
 *        3. 코드를 재사용
 *        	 코드 관리 용이
 *        	 신뢰성
 *           ------------------------ 객체 지향 프로그램
 *        
 *      => 기본 문법 => 활용
 *      => 자바 / 오라클 / HTML / CSS / JavaScript
 *                                  ----------
 *                                      |
 *                                    Ajax/JQuery/VueJS/React
 *                                    => React-Query
 *                                       -----------
 *      => JSP : 활용 => 사이트
 *      => 실무 : Spring / Spring-Boot
 *         => MSA(서버,분산) => DevOps (CI/CD) => Git
 *            ------------------------------------
 *   => 자바 
 *      ---
 *      1. 변수
 *      2. 연산자
 *      3. 제어문
 *      ------------- 기본 문법 (알파벳=> 단어)
 *      4. 배열
 *      5. 메소드
 *      ------------- 숙어
 *      6. 클래스 --> 문장 (컴퓨터와 통신)
 *         ----
 *        => 1) 구성요소 
 *        [접근 지정어][옵션] class ClassName{
 *        
 *        }
 *      
 */
public class MainClass {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
